ИС_СПОРТ_2022/src/Documents/ВводВидаСпортаВручную/ВводВидаСпортаВручную.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводВидаСпортаВручную</name>
  <registerRecords>AccumulationRegister.КоличествоВидовСпортаТренеров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВидаСпорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/ВводВидаСпортаВручную/ManagerModule.bsl
#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	""КоличествоВидовСпортаТренеров"" КАК ИмяРегистра_,
	                |	ВводВидаСпортаВручную.ДатаВводаВидаСпорта КАК Период,
	                |	ВводВидаСпортаВручную.Организация КАК Организация,
	                |	ВводВидаСпортаВручную.Тренер КАК Тренер,
	                |	ВводВидаСпортаВручную.ВидСпорта КАК ВидСпорта,
	                |	1 КАК КоличествоТренеров,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                |	ВводВидаСпортаВручную.ДатаВводаВидаСпорта КАК ДатаВидаСпорта
	                |ИЗ
	                |	Документ.ВводВидаСпортаВручную КАК ВводВидаСпортаВручную
	                |ГДЕ
	                |	ВводВидаСпортаВручную.Ссылка = &Ссылка";
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаКоличествоВидовСпортаТренеров", Запрос.Выполнить().Выгрузить());
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ВводВидаСпортаВручную.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ВводВидаСпортаВручную.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ВводВидаСпортаВручную.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
